InformationRegisters/СтавкиАкцизаПоставляемый.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СтавкиАкцизаПоставляемый</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкруглятьДоЦелого</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КодВидаПодакцизногоТовара</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/УчетАкцизовВызовСервера/Ext/Module.bsl
// Содержимое модуля отличается в версиях ПРОФ и КОРП.
// В версии ПРОФ отсутствует:
// - тело экспортных процедур (остаются только сигнатуры методов)
// - неэкспортные процедуры и все функции.
// Поэтому не допускается реализация в модуле экспортных функций: вместо них следует использовать процедуры с возвращаемым параметром.

#Область ПрограммныйИнтерфейс

Процедура ПолучитьЕдиницуИзмеренияПоСтавкеАкциза(ВидПодакцизногоТовара, ЕдиницаИзмеренияАкциза) Экспорт
	ДатаДействия = '00010101';
	ТекДата = ТекущаяДата();
	Если ЗначениеЗаполнено(ВидПодакцизногоТовара) Тогда
		ДатаДействия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидПодакцизногоТовара, "ДействуетС");
	КонецЕсли;
	КодВидаПодакцизногоТовара = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидПодакцизногоТовара, "Код");
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("КодТовара", КодВидаПодакцизногоТовара);
	Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(ДатаДействия) И ДатаДействия > ТекДата, ДатаДействия, ТекДата));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтавкиАкцизаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ИЗ
	|	РегистрСведений.СтавкиАкцизаПоставляемый.СрезПоследних(&Дата, КодВидаПодакцизногоТовара = &КодТовара) КАК СтавкиАкцизаСрезПоследних";
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		ЕдиницаИзмеренияАкциза = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду(Результат.ЕдиницаИзмерения);
	Иначе
		ЕдиницаИзмеренияАкциза = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
